# Задача 6: Вы пользуетесь общественным транспортом? Вероятно, вы расплачивались за проезд и получали билет с номером. Счастливым билетом называют такой билет с шестизначным номером, где сумма первых трех цифр равна сумме последних трех. Т.е. билет с номером 385916 – счастливый, т.к. 3+8+5 = 9+1+6. Вам требуется написать программу, которая проверяет счастливость билета.

# *Пример: *

# 385916 -> yes
# 123456 -> no

num = input('Введите шестизначный номер билетика: ')

while not num.isdigit() or len(num) != 6:
  num = input('Вы ввели неправильный номер, попробуйте еще разок: ')

sum1 = 0
for i in range(len(num)//2):
  sum1 += int(num[i])

sum2 = 0
for i in range(len(num)//2,len(num)):
  sum2 += int(num[i])

if  sum1 == sum2:
  print('Удача! Билетик счастливый!')
else:
  print('Билет не счастливый, но не расстраивайтесь!')